In [1]:
import sqlite3
import pandas as pd

In [2]:
def db_interact(query):
    return pd.read_sql_query(query,db)

In [3]:
db = sqlite3.connect('data/hubway.db')

## SQL style guide

It's a good practise to:
 * CAPITALIZE commmand keywords
 * line breaks for each clause
 * conisder readability and logical blocks
 * SQL is case-**in**sensitive
 * avoid redundant quotes

In [4]:
# bad style but workung example
query = """
select BiKE_NUMBER, BIRTH_DATE
from TRIPS
limit 1
"""

In [5]:
db_interact(query)

  bike_number  birth_date
0      B00468      1976.0

### nicely formatted

In [7]:
query = """
SELECT bike_number, birth_date
FROM trips
LIMIT 10
"""

##### SQL statements may become complex! Proper style is helpful.

## Projections with AS

Renaming with AS

In [9]:
query = """
SELECT bike_number AS id, birth_date as birthyear
FROM trips
LIMIT 10
"""

In [10]:
db_interact(query)

       id  birthyear
0  B00468     1976.0
1  B00554     1966.0
2  B00456     1943.0
3  B00554     1981.0
4  B00554     1983.0
5  B00456     1951.0
6  B00554     1971.0
7  B00554     1971.0
8  B00554     1983.0
9  B00550     1994.0